export const NEWS_POSTS = [
  {
    id: 1,
    title: 'О нас',
    description: `
    Ты студент и заебался от бесконечных курсовых и дипломов? Тебя заебали преподы? Предлагаю решение. TonStudents – твоя площадка для покупки готовых работ за криптовалюту TON.
    Анонимно, быстро, удобно. Мы обеспечим качественные решения для твоих задач, а ты сможешь сосредоточиться на дрочке или личной жизни.
    Забудь нахуй про стресс и бессоные ночи – всё, что нужно, это несколько кликов. Сделай свою жизнь проще с TonStudents!
    `,
  },
  {
    id: 2,
    title: 'Наши преимущества',
    description:
      'Мы разработали анонимное приложение для покупки курсовы, дипломов, проектных работ и прочей студенческой бумажной волокиты. В нашем приложении вы в 2 клика можете купить нужную вам работу по привлекательным ценам. А самое главное это полностью анонимно за счет блокчейна и ни креатор не знает о пользователе ничего ни пользователь о креаторе...',
  },
  {
    id: 3,
    title: 'Контакты',
    description: `
      Связаться с нами пиздец как просто: заходишь в наш тгк и от туда в чат, в чате тэгаешь админа и он придет и ответит на твои вопросы.
      Ну или если ты ленивый чорт можешь тупо написать мне в тг: @YourMomsAdmin
    `,
  },
];
